{
  "algorithm": "A collection of ordered steps that solve a mathematical problem. A precise step-by-step plan for a computational procedure that possibly begins with an input value and yields an output value in a finite number of steps.",
  "benchmark": "A standard by which something is evaluated or measured.",
  "compilation": "The act or process of compiling or gathering together from various sources.",
  "distributed": "To divide into portions and dispense.",
  "encryption": "The process of obscuring information to make it unreadable without special knowledge, key files, or passwords.",
  "functional": "A function that takes a function as its argument; More precisely: A function y=f(x) whose argument x varies in a space of (real valued, complex valued) functions and whose value belongs to a monodimensional space. An example: the definite integration of integrable real functions in a real interval.",
  "graphic": "A drawing or picture.",
  "hash": "Food, especially meat and potatoes, chopped and mixed together.",
  "interpreter": "One who conveys what a user of one language is saying or signing, in real time or shortly after that person has finished communicating, to a user of a different language. (Contrasted with a translator.)",
  "java": "A blend of coffee imported from the island of Java.",
  "kernel": "The core, center, or essence of an object or system.",
  "logic": "A method of human thought that involves thinking in a linear, step-by-step manner about how a problem can be solved. Logic is the basis of many principles including the scientific method.",
  "machine": "A device that directs and controls energy, often in the form of movement or electricity, to produce a certain effect.",
  "node": "A knot, knob, protuberance or swelling.",
  "obfuscate": "To make dark; overshadow",
  "parallel": "One of a set of parallel lines.",
  "queue": "An animal's tail.",
  "recursive": "Drawing upon itself, referring back.",
  "static": "Interference on a broadcast signal caused by atmospheric disturbances; heard as crackles on radio, or seen as random specks on television.",
  "thread": "A long, thin and flexible form of material, generally with a round cross-section, used in sewing, weaving or in the construction of string.",
  "universal": "A characteristic or property that particular things have in common.",
  "virtual": "A virtual member function of a class.",
  "web": "The World Wide Web.",
  "xenon": "The chemical element (symbol Xe) with an atomic number of 54. It is a colorless, odorless, unreactive noble gas, used notably in camera flash technology.",
  "yield": "To pay, give in payment; repay, recompense; reward; requite.",
  "zero": "The numeric symbol that represents the cardinal number zero."
}
